{
    "introductions": [{
            "id": "0",
            "text": "Dear (INPUT) with this letter I would like to submit my application to work for you as (INPUT). I came accross your company",
            "inputs": [
                "Input Addressed Person or body: ",
                "Applied Position: "
            ]
        },
        {
            "id": "1",
            "text": "Dear (INPUT), with this letter I would like to submit my application to work for you as (INPUT). I came across your company while looking for jobs for (INPUT), and I believe I could bring you (INPUT). I have (INPUT) years of experience in (INPUT), I love working with (INPUT).",
            "inputs": [
                "Input Addressed Person or company: ",
                "Applied Position: ",
                "What were you looking for when you came across this posting: ",
                "What you bring to the table: ",
                "Years of experience: ",
                "List what you have been doing: ",
                "Love working with: "
            ]
        }


    ],
    "bodies": [{
        "id": "0",
        "text": "I’ve come to notice my obsession with documenting my life, because of this obsession I have bounced a lot around technologies, experiencing both front and backend development, I have worked with (INPUT) , APIs, Databases, web scraping, Data analysis, I did a year of quantitative trading where I exclusively focused on algorithm development. This gives me an edge in extracting the important bits in large data. (INPUT). I have had small encounters with (INPUT).Besides my technical capabilities, I am interested in risk aversion, management styles, psychology, and most of all I love exchanging ideas with people.",
        "inputs": [
            "Additional skills not yet listed: ",
            "How my skills help the company: ",
            "Skill I have minimum experience with: "
        ]
    }],
    "endings": [{
        "id": "0",
        "text": "I would be delighted to discuss ways I can help the company grow, and to find out if I would be the right fit for your community. Thank you for the opportunity to share my opinions, I look forward to hearing from you.",
        "inputs": [

        ]
    }]
}